# Development
brew 'git-lfs'
brew 'git'
brew 'python3'
brew 'ruby'
brew 'shellcheck'
brew 'sqlite'

# Utils
brew 'aria2'
brew 'jq'
brew 'yt-dlp'

# Apps
cask '1password'
cask 'apparency'
cask 'blockblock'
cask 'coderunner'
cask 'crossover'
cask 'ghostty'
cask 'github'
cask 'hex-fiend'
cask 'hopper-disassembler'
cask 'itsycal'
cask 'keka'
cask 'knockknock'
cask 'latest'
cask 'macs-fan-control'
cask 'monodraw'
cask 'orbstack'
cask 'pixelsnap'
cask 'postico'
cask 'proxyman'
cask 'rapidapi'
cask 'sketch'
cask 'sublime-merge'
cask 'suspicious-package'
cask 'telegram'
cask 'utm'
cask 'visual-studio-code'
cask 'vlc'
cask 'xcodes'

# VSCode extensions
vscode 'monokai.theme-monokai-pro-vscode'
vscode 'streetsidesoftware.code-spell-checker'
vscode 'ms-vscode.live-server'
vscode 'waderyan.gitblame'
vscode 'github.vscode-github-actions'
