# Sources
tap 'homebrew/core'
tap 'homebrew/bundle' # for Brewfile
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/boneyard' # for class-dump
tap 'rodionovd/taps' # for shortcuts
# CLI utilities
brew 'sqlite'
brew 'ansible'
brew 'autossh'
brew 'cloc'
brew 'git'
brew 'mas'
brew 'pandoc'
brew 'python3'
brew 'rbenv'
brew 'zsh'
brew 'carthage'
brew 'cocoapods'
#brew 'class-dump', args: ['HEAD']
brew 'rodionovd/taps/shortcuts'
# Apps
cask '0xed'
cask 'blockblock'
cask 'coderunner'
cask 'firefox'
cask 'github'
cask 'haskell-for-mac'
cask 'hex-fiend'
cask 'hopper-disassembler'
cask 'iterm2'
cask 'marked'
cask 'monodraw'
cask 'pacifist'
cask 'paw'
cask 'rb-app-checker-lite'
cask 'sketch'
cask 'stride'
cask 'slack'
cask 'suspicious-package'
cask 'the-unarchiver'
cask 'vlc'
cask 'wwdc'
cask 'alfred'
cask 'day-o'
# Fonts
cask 'font-fira-code'
cask 'font-hack'
cask 'font-monoid'
