# Sources
tap 'homebrew/core'
tap 'homebrew/bundle' # for Brewfile
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'

# Runtimes
brew 'python3'
brew 'ruby'
brew 'openjdk'

# Utils
brew 'aria2'
brew 'carthage'
#brew 'class-dump', args: ['HEAD']
brew 'cocoapods'
brew 'fastlane'
brew 'git'
brew 'git-lfs'
brew 'jq'
brew 'shellcheck'
brew 'sqlite'
brew 'yt-dlp'

# Apps
cask '0xed'
cask '1password'
cask 'alfred'
cask 'apparency'
cask 'blockblock'
cask 'chrome'
cask 'coderunner'
cask 'day-o'
cask 'figma'
cask 'github'
cask 'hopper-disassembler'
cask 'iterm2'
cask 'itsycal'
cask 'latest'
cask 'libreoffice'
cask 'macs-fan-control'
cask 'marked'
cask 'microsoft-teams'
cask 'monodraw'
cask 'orbstack'
cask 'parallels'
cask 'pixelsnap'
cask 'proxyman'
cask 'rapidapi'
cask 'sketch'
cask 'slack'
cask 'sublime-merge'
cask 'suspicious-package'
cask 'telegram'
cask 'the-unarchiver'
cask 'tunnelbear'
cask 'utm'
cask 'visual-studio-code'
cask 'vlc'
cask 'whisky'
cask 'xcodes'

# Fonts
cask 'font-hack'
