brew 'git-lfs'
brew 'git'
brew 'node'

# Utils
brew 'aria2'
brew 'jq'
brew 'yt-dlp'
brew "ffmpeg"
brew "mpv"
brew "socat"

# Apps
cask '1password'
cask 'crossover'
cask 'figma'
cask 'ghostty'
cask 'github'
cask 'keka'
cask 'macs-fan-control'
cask 'steam'
cask 'telegram'
cask 'transmission'
cask 'chrome'
cask 'visual-studio-code'
cask 'vlc'
cask 'xcodes-app'
cask 'bettermouse'
cask 'chatgpt'
cask 'hkamran80/things/multiliner'
cask 'sf-symbols'
cask "webtorrent"
cask 'proxyman'

# VSCode extensions
vscode 'monokai.theme-monokai-pro-vscode'
