# hey eye
brew 'anomalyco/tap/opencode', trusted: true
cask 'claude-code'
cask 'codex'

# Development
brew 'clang-format'
brew 'git-lfs'
brew 'git'
brew 'node'
brew 'oven-sh/bun/bun', trusted: true
brew 'python3'
brew 'ruby'
brew 'shellcheck'
brew 'swift-format'
brew 'sqlite'

# Utils
brew 'aria2'
brew 'jq'
brew 'yt-dlp'
brew 'rom-tools'

# Apps
cask '1password'
cask '1password-cli'
cask 'apparency'
cask 'blockblock'
cask 'coderunner'
cask 'crossover'
cask 'fastscripts'
cask 'figma'
cask 'freac'
cask 'ghostty'
cask 'github'
cask 'hex-fiend'
cask 'hopper-disassembler'
cask 'itsycal', postinstall: "open -a /Applications/Itsycal.app"
cask 'keka'
cask 'knockknock'
cask 'latest'
cask 'libreoffice'
cask 'macs-fan-control'
cask 'macdroid'
cask 'monodraw'
cask 'notion'
# OrbStack doesn't work inside a VM (which I use to test this .dotfiles setup)
# because nested virtualization is only available on M3+ Macs
cask 'orbstack', postinstall: '/bin/zsh -c "${HOMEBREW_PREFIX}/bin/orb start || true"'
cask 'pixelsnap'
cask 'postico'
cask 'proxyman'
cask 'rapidapi'
cask 'sketch'
cask 'slack'
cask 'steam'
cask 'sublime-merge'
cask 'suspicious-package'
cask 'telegram'
cask 'tower'
cask 'transmission'
cask 'ungoogled-chromium'
cask 'virtualbuddy'
cask 'visual-studio-code'
cask 'vlc'
cask 'xcodes-app'
cask 'zoom'

# VSCode extensions
vscode 'teabyii.ayu'
vscode 'streetsidesoftware.code-spell-checker'
vscode 'ms-vscode.live-server'
vscode 'waderyan.gitblame'
vscode 'github.vscode-github-actions'
vscode 'dbaeumer.vscode-eslint'
vscode 'esbenp.prettier-vscode'
vscode 'timonwong.shellcheck'
